Revit 2027 API
ParameterTypeId.StructuralSectionComputeAutomaticalyAnalysisProperties Property
 "Enable Auto-Calculation of Values"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralSectionComputeAutomaticalyAnalysisProperties { get; }
Public Shared ReadOnly Property StructuralSectionComputeAutomaticalyAnalysisProperties As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralSectionComputeAutomaticalyAnalysisProperties {
	ForgeTypeId^ get ();
}
static member StructuralSectionComputeAutomaticalyAnalysisProperties : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace